In [1]:
import pandas as pd

In [2]:
import numpy as np

# 1. 재색인
## reindex(  )

In [3]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [4]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [5]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [6]:
obj2  #e는 결측치

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

새로 설정한 index순서에 맞게 재배열 하고 없는 값은 NaN(결측값 )처리 한다.

In [7]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

fill_value = 0 : 결측값을 0으로 채운다.

In [8]:
obj3 = pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [9]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [11]:
obj3.reindex(range(6),method='bfill') #bfill : 뒤에 있는 값 추가하기

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [12]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),index = ['a','b','c'],columns = ['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [23]:
frame.reindex(['a','b','c','d'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [13]:
frame.reindex(columns = ['Ohio','utah','California'])           #열을 바꾸는 경우

   Ohio  utah  California
a     0   NaN           2
b     3   NaN           5
c     6   NaN           8

# 2. 색인하기, 선택하기, 거르기

In [15]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = ['Ohio','Colorado','Utah','New York'],
                   columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## 1)데이터 프레임에서 column 선택하기

In [16]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [17]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

## 2) 데이터 프레임에서 row 선택하기

In [18]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [19]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## 3) .loc : row, columns을 선택하기

In [20]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [21]:
data.loc[['Colorado','Utah'],['three','one']]

          three  one
Colorado      6    4
Utah         10    8

In [54]:
data.iloc[2] # 2번째 행을 가져온 것

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [55]:
data.iloc[2,3] #2번째 행 3번째 열

11

In [56]:
data.loc[:'Utah','two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [61]:
data.loc[data['three']>5,:'three']

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

# 3. 함수 적용과 매핑

In [65]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [63]:
f = lambda x: x.max() - x.min()

In [64]:
data.apply(f)

one      12
two      12
three    12
four     12
dtype: int64

# 4. 정렬

In [72]:
obj = pd.DataFrame(np.arange(8).reshape(2,4),index=['three','one'],columns=['d','a','b','c'])

In [73]:
obj

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

### 1) 행이름 기준 정렬 : sort_index(  )

In [77]:
obj.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

### 2) 열이름 기준 정렬

In [75]:
obj.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [76]:
obj.sort_index(axis=1,ascending =False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

### 3) 값에 따라 정렬 : sort_values(  )

In [92]:
frame = pd.DataFrame({
    'b':[4,7,-3,2],
    'a':[0,1,0,1]
    
})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [83]:
frame.sort_values(by='b')  #어떤 열을 기준으로?

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [84]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

# 5. 기술통계 계산과 요약

### 1) sum( )

In [87]:
frame.sum() #columns의 합

b    10
a     2
dtype: int64

In [88]:
frame.sum(axis=1) #row의 합

0    4
1    8
2   -3
3    3
dtype: int64

### 2) mean( ) , skipna

In [93]:
frame.loc[2,'b']=np.nan

In [94]:
frame

     b  a
0  4.0  0
1  7.0  1
2  NaN  0
3  2.0  1

In [96]:
frame.mean(axis=1,skipna=False)

0    2.0
1    4.0
2    NaN
3    1.5
dtype: float64

In [97]:
frame.mean(axis=1,skipna=True)  #true가 디폴트

0    2.0
1    4.0
2    0.0
3    1.5
dtype: float64

### 3)describe( )

In [100]:
frame.describe()  #column별로 통계량을 알려줌

              b        a
count  3.000000  4.00000
mean   4.333333  0.50000
std    2.516611  0.57735
min    2.000000  0.00000
25%    3.000000  0.00000
50%    4.000000  0.50000
75%    5.500000  1.00000
max    7.000000  1.00000

### 4) 상관관계와 공분산 : corr( ), cov( )

In [111]:
data= pd.DataFrame(np.random.normal(size=16).reshape(4,4))

In [112]:
data

          0         1         2         3
0  0.432387  0.528876 -0.207394  0.452774
1 -0.524013 -0.476301 -0.339093 -0.350946
2  0.159992 -0.663375 -0.281790  0.141097
3  0.234109  1.340900  1.052557  1.227984

In [113]:
data.corr()

          0         1         2         3
0  1.000000  0.541834  0.327490  0.700171
1  0.541834  1.000000  0.862593  0.912558
2  0.327490  0.862593  1.000000  0.902941
3  0.700171  0.912558  0.902941  1.000000

In [114]:
data.cov()

          0         1         2         3
0  0.173027  0.210280  0.090795  0.192834
1  0.210280  0.870464  0.536398  0.563715
2  0.090795  0.536398  0.444234  0.398464
3  0.192834  0.563715  0.398464  0.438376

In [116]:
data.corrwith(data[1])

0    0.541834
1    1.000000
2    0.862593
3    0.912558
dtype: float64

### 5) 유일 값, 값 세기, 멤버십

In [117]:
obj = pd.Series(['c','a','d','a','a','b','c','b','c','a','c'])
obj

0     c
1     a
2     d
3     a
4     a
5     b
6     c
7     b
8     c
9     a
10    c
dtype: object

In [118]:
#유일 값만 담고있는 시리즈 출력
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [120]:
#시리즈의 도수계산
obj.value_counts()

a    4
c    4
b    2
d    1
dtype: int64

In [123]:
#골라내기
mask = obj.isin(['b','c'])  #0~10이 b,c에 속하는지 확인, true인것만 추출해줌.
print(mask)
print(obj[mask])

0      True
1     False
2     False
3     False
4     False
5      True
6      True
7      True
8      True
9     False
10     True
dtype: bool
0     c
5     b
6     c
7     b
8     c
10    c
dtype: object